schedule = {
    1: {
        1: "Математика",
        2: "Фізика",
        3: "Інформатика"
    },
    2: {
        1: "Література",
        2: "Історія",
        3: "Географія"
    }
}

# Введення номера тижня і дня
week = int(input("Введіть номер тижня (1 або 2): "))
day = int(input("Введіть номер дня тижня (1, 2 або 3): "))

# Виведення розкладу
if week in schedule and day in schedule[week]:
    print(f"Ваш предмет на {day}-ий день тижня: {schedule[week][day]}")
else:
    print("Неправильний номер тижня або дня.")